/*********************************************************************
 *
 *                           delay.h
 *
 *********************************************************************
 * 描    述: 单片机延时函数集
 * 开发平台: KEIL C51
 * 公    司: 			
 * 网    址: 
 * 作者			         日期		  注释
 *~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 * 飞云创意电子		   14/01/09		原始文件
 * 飞云创意电子        16/09/05        V1.0            通过示波器调整程序，使STC15F2K60S2用下面两个程序能产生较准确延时
 ********************************************************************/


#ifndef DELAY_H
#define DELAY_H

#include<stc15series.h>
#include "intrins.h"


/****************************函数声明************************************/
void delayms(unsigned int z);
void delay_10us(unsigned int z);


#endif